## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_glue_catalog_database.platform_gc_forms_production_raw`  |
|        | `aws_glue_crawler.platform_gc_forms_templates_production_raw` |
| delete | `aws_glue_crawler.platform_gc_forms_templates_production`     |
| update | `aws_glue_job.bes_crm_salesforce`                             |
|        | `aws_s3_object.bes_crm_salesforce_job`                        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_glue_catalog_database.platform_gc_forms_production_raw will be created
  + resource "aws_glue_catalog_database" "platform_gc_forms_production_raw" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "RAW: data source path: /platform/gc-forms/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_gc_forms_production_raw"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_crawler.platform_gc_forms_templates_production will be destroyed
  # (because aws_glue_crawler.platform_gc_forms_templates_production is not in configuration)
  - resource "aws_glue_crawler" "platform_gc_forms_templates_production" {
      - arn                    = "arn:aws:glue:ca-central-1:739275439843:crawler/Platform / GC Forms / Templates" -> null
      - classifiers            = [] -> null
      - configuration          = jsonencode(
            {
              - CrawlerOutput        = {
                  - Tables = {
                      - TableThreshold = 3
                    }
                }
              - CreatePartitionIndex = true
              - Version              = 1.0
            }
        ) -> null
      - database_name          = "platform_gc_forms_production" -> null
      - description            = "Classify the GC Forms template data" -> null
      - id                     = "Platform / GC Forms / Templates" -> null
      - name                   = "Platform / GC Forms / Templates" -> null
      - role                   = "service-role/AWSGlueCrawler-DataLake" -> null
      - security_configuration = "encryption-at-rest" -> null
      - table_prefix           = "forms_" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
        # (1 unchanged attribute hidden)

      - lake_formation_configuration {
          - use_lake_formation_credentials = false -> null
            # (1 unchanged attribute hidden)
        }

      - lineage_configuration {
          - crawler_lineage_settings = "DISABLE" -> null
        }

      - recrawl_policy {
          - recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

      - s3_target {
          - exclusions          = [] -> null
          - path                = "s3://cds-data-lake-transformed-production/platform/gc-forms" -> null
          - sample_size         = 0 -> null
            # (3 unchanged attributes hidden)
        }

      - schema_change_policy {
          - delete_behavior = "DEPRECATE_IN_DATABASE" -> null
          - update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_crawler.platform_gc_forms_templates_production_raw will be created
  + resource "aws_glue_crawler" "platform_gc_forms_templates_production_raw" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 4
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "platform_gc_forms_production_raw"
      + description            = "Classify the raw GC Forms template data"
      + id                     = (known after apply)
      + name                   = "Platform / GC Forms / Templates"
      + role                   = "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      + schedule               = "cron(00 6 * * ? *)"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "platform_gc_forms_raw_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://cds-data-lake-raw-production/platform/gc-forms"
        }
    }

  # aws_glue_job.bes_crm_salesforce will be updated in-place
  ~ resource "aws_glue_job" "bes_crm_salesforce" {
      ~ default_arguments         = {
          ~ "--enable-observability-metrics"     = "false" -> "true"
            # (14 unchanged elements hidden)
        }
      - execution_class           = "STANDARD" -> null
        id                        = "BES / CRM / Salesforce"
        name                      = "BES / CRM / Salesforce"
        tags                      = {}
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_object.bes_crm_salesforce_job will be updated in-place
  ~ resource "aws_s3_object" "bes_crm_salesforce_job" {
      ~ etag                          = "9823070213b5316965caa8ea11b89070" -> "b68fa948ce223ed25fc34ca422ebc6d1"
        id                            = "bes/crm/salesforce/process_salesforce.py"
        tags                          = {}
      ~ tags_all                      = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      ~ version_id                    = "LMsmmQFgSPO9AkVbYXliTDnOxFY4o1gq" -> (known after apply)
        # (22 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
